GT3/RANS-kklo/0/kl
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      kl;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;	//important

boundaryField
{
    lowerWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    lowerSymmetry
    {
        type            zeroGradient;
    }
    upperSymmetry
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        //value           uniform 0;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
